scripts/verify/batch7/_b4_heartbeat_capacity.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="B4 heartbeat capacity" enabled="true">
      <stringProp name="TestPlan.comments">Heartbeat uplink capacity probe. Device secrets injected via -JcsvPath (tab-separated deviceNo/secret, never committed). state omitted = alive-only path (no reconcile side effects by design).</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="heartbeat load" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">true</boolProp>
          <stringProp name="LoopController.loops">-1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${__P(threads,10)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${__P(ramp,3)}</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">${__P(duration,30)}</stringProp>
      </ThreadGroup>
      <hashTree>
        <OnceOnlyController guiclass="OnceOnlyControllerGui" testclass="OnceOnlyController" testname="bind device (once per thread)" enabled="true"/>
        <hashTree>
          <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler" testname="bind device" enabled="true">
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="script"><![CDATA[
String csvPath = props.get("csvPath")
if (!csvPath) { throw new IllegalStateException("csvPath missing: use -JcsvPath=<tab-separated deviceNo/secret file>") }
List lines = new File(csvPath).readLines().findAll { it != null && it.trim().length() > 0 }
int pool = Integer.parseInt(props.get("devicePool", String.valueOf(lines.size())))
// JMeter 5.6.3 ctx.getThreadNum() is verified 0-based (thread "1-1" -> tn=0, probed). floorMod keeps the
// mapping uniform under either 0-based or 1-based numbering, so every thread binds its own device.
int idx = Math.floorMod(ctx.getThreadNum(), Math.min(pool, lines.size()))
String[] parts = lines.get(idx).split("\t")
vars.put("deviceNo", parts[0].trim())
vars.put("secret", parts[1].trim())
]]></stringProp>
            <stringProp name="cacheKey">false</stringProp>
          </JSR223Sampler>
          <hashTree/>
        </hashTree>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="device headers" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">X-Device-No</stringProp>
              <stringProp name="Header.value">${deviceNo}</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">X-Device-Sign</stringProp>
              <stringProp name="Header.value">${sign}</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST /api/device/heartbeat" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{"deviceNo":"${deviceNo}"}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${__P(host,127.0.0.1)}</stringProp>
          <stringProp name="HTTPSampler.port">${__P(port,8200)}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/device/heartbeat</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="throttle (per-thread rps via -Jthread_rps_x100)" enabled="true">
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="script"><![CDATA[
long rpsX100 = Long.parseLong(props.get("thread_rps_x100", "400"))
long perReqMillis = Math.max(1L, (long) Math.ceil(100000.0 / rpsX100))
String last = vars.get("lastSent")
long elapsed = last == null ? Long.MAX_VALUE : (System.currentTimeMillis() - Long.parseLong(last))
long wait = perReqMillis - elapsed
if (wait > 0L) { Thread.sleep(wait) }
vars.put("lastSent", String.valueOf(System.currentTimeMillis()))
]]></stringProp>
            <stringProp name="cacheKey">false</stringProp>
          </JSR223PreProcessor>
          <hashTree/>
          <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="sign heartbeat (HMAC deviceNo|state, state empty)" enabled="true">
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="script"><![CDATA[
import javax.crypto.Mac
import javax.crypto.spec.SecretKeySpec
String deviceNo = vars.get("deviceNo")
String secret = vars.get("secret")
String canonical = deviceNo + "|"
Mac mac = Mac.getInstance("HmacSHA256")
mac.init(new SecretKeySpec(secret.getBytes("UTF-8"), "HmacSHA256"))
byte[] raw = mac.doFinal(canonical.getBytes("UTF-8"))
StringBuilder sb = new StringBuilder(raw.length * 2)
for (byte b : raw) { sb.append(String.format("%02x", b & 0xFF)) }
vars.put("sign", sb.toString())
]]></stringProp>
            <stringProp name="cacheKey">false</stringProp>
          </JSR223PreProcessor>
          <hashTree/>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>